{
  "title": "Milkbar Carrot Graham Cake",
  "version": "v0.0.1",
  "components": [
    {
      "name": "Carrot Cake",
      "ingredients": [
        ["Butter, room temp", "230 grams"],
        ["Light brown sugar", "240 grams"],
        ["Granulated sugar", "200 grams"],
        ["Eggs", "4 large"],
        ["Neutral oil", "80 grams"],
        ["Flour", "400 grams"],
        ["Baking powder", "8 grams"],
        ["Baking soda", "3 grams"],
        ["Ground cinnamon", "3 grams"],
        ["Kosher salt", "10 grams"],
        ["Shredded carrots", "450 grams"]
      ],
      "instructions": [
        "Heat the oven to 350°F.",
        "Combine the butter and sugars in the bowl of a stand mixer fitted with the paddle attachment. Cream together on medium-high for 2 to 3 minutes. Scrape down the sides of the bowl, add the eggs, and mix on medium-high for another 2 to 3 minutes. Scrape down the sides of the bowl once more.",
        "On low speed, stream in the oil. Increase the mixer speed to medium-high and mix for 4 to 6 minutes, until the mixture is pale, nearly white, and has doubled in volume, with no streaks of fat remaining. Stop the mixer and scrape down the sides of the bowl.",
        "On very low speed, add the flour, baking powder, baking soda, cinnamon, and salt. Mix for 45 to 60 seconds, just until the batter comes together and no dry ingredients remain. Scrape down the sides of the bowl.",
        "Remove the bowl from the mixer. Add the shredded carrots and fold them into the batter with a spatula until evenly incorporated.",
        "Spray a 13 × 18-inch sheet pan with cooking spray and line with parchment. Spread the cake batter evenly in the pan with a spatula.",
        "Bake the cake for 25 to 30 minutes. The cake will rise and puff, doubling in size, but will remain slightly buttery and dense. At 25 minutes, gently press the edge of the cake with your finger: it should spring back slightly and the center should no longer be jiggly. If not, bake for an additional 3 to 5 minutes.",
        "Cool the cake on a wire rack. To speed cooling, place the pan in the fridge or freezer. Once cool, the cake can be stored wrapped in plastic wrap in the fridge for up to 5 days."
      ]
    },
    {
      "name": "Liquid Cheesecake",
      "ingredients": [
        ["Cream cheese", "450 grams"],
        ["Sugar", "300 grams"],
        ["Cornstarch", "12 grams"],
        ["Kosher salt", "4 grams"],
        ["Milk", "50 grams"],
        ["Eggs", "2 large"]
      ],
      "instructions": [
        "Heat the oven to 300°F.",
        "Put the cream cheese in the bowl of a stand mixer fitted with the paddle attachment. Mix on low speed for 2 minutes, then scrape down the sides of the bowl. Add the sugar and mix for 1 to 2 minutes until fully incorporated. Scrape down the sides again.",
        "In a medium bowl, whisk together the cornstarch and salt. Slowly whisk in the milk, then whisk in the eggs until the mixture is smooth and homogeneous.",
        "With the mixer on medium-low speed, stream in the egg mixture. Mix for 3 to 4 minutes, until smooth and loose. Scrape down the sides of the bowl.",
        "Line the bottom and sides of a 9 × 13-inch baking pan with parchment. Pour in the cheesecake batter. Bake for 15 minutes, then gently shake the pan. The cheesecake should be set around the edges but still slightly jiggly in the center. If it is underbaked, continue baking in 5-minute increments, but remove immediately if it rises more than 1/4 inch or begins to brown. Total bake time should not exceed 25 minutes.",
        "Cool the cheesecake completely to finish setting. The texture should be spreadable and pliable, but still hold its shape. Once cool, store in an airtight container in the fridge for up to 1 week. Whisk to a smooth texture before layering in the final cake."
      ]
    },
    {
      "name": "Milk Crumb",
      "ingredients": [
        ["Milk powder (first addition)", "80 grams"],
        ["Flour", "80 grams"],
        ["Cornstarch", "24 grams"],
        ["Sugar", "50 grams"],
        ["Kosher salt", "4 grams"],
        ["Melted butter", "110 grams"],
        ["Milk powder (second addition)", "40 grams"],
        ["Melted white chocolate", "180 grams"]
      ],
      "instructions": [
        "Heat the oven to 250°F.",
        "In a medium bowl, combine the 80 grams milk powder (first addition), flour, cornstarch, sugar, and salt. Mix with your hands to evenly distribute the dry ingredients. Add the melted butter and toss with a spatula until small clusters form.",
        "Spread the clusters on a parchment-lined sheet pan and bake for 20 minutes, stirring once at the 10 minute mark, until sandy and fragrant. Cool completely.",
        "Break up any clusters larger than 1/2 inch in diameter. Place the crumbs in a medium bowl and add the 40 grams milk powder (second addition), tossing to combine evenly.",
        "Pour the melted white chocolate over the crumbs and toss until the clusters are coated. Continue tossing every 5 minutes until the chocolate hardens and the clusters are no longer sticky. Store in an airtight container in the fridge or freezer for up to 1 month."
      ]
    },
    {
      "name": "Graham Crust",
      "ingredients": [
        ["Graham cracker crumbs", "190 grams"],
        ["Milk powder", "20 grams"],
        ["Sugar", "25 grams"],
        ["Kosher salt", "3 grams"],
        ["Melted butter", "55 grams"],
        ["Heavy cream", "55 grams"]
      ],
      "instructions": [
        "In a medium bowl, toss the graham crumbs, milk powder, sugar, and salt together until evenly combined.",
        "Whisk the melted butter and cream together, then add to the dry ingredients. Toss until evenly coated and clusters form. The mixture should hold its shape when squeezed in your hand. If too dry, add an additional 14 to 25 grams of melted butter and mix again.",
        "Use immediately or as directed in recipes. The crust is easiest to mold right after mixing. Store in an airtight container for 1 week at room temperature or up to 1 month in the fridge or freezer."
      ]
    },
    {
      "name": "Graham Frosting",
      "ingredients": [
        ["Graham crust (from above)", "1 recipe"],
        ["Milk", "170 grams"],
        ["Kosher salt", "4 grams"],
        ["Butter, room temp", "170 grams"],
        ["Light brown sugar", "30 grams"],
        ["Confectioners’ sugar", "20 grams"],
        ["Ground cinnamon", "1 gram"]
      ],
      "instructions": [
        "Combine the graham crust, milk, and salt in a blender. Blend on medium-high until smooth and homogeneous, 1 to 3 minutes. If the mixture does not circulate, stop and scrape down the sides and under the blade, then blend again.",
        "In the bowl of a stand mixer fitted with the paddle attachment, combine the butter, brown sugar, confectioners’ sugar, and cinnamon. Cream together on medium-high for 2 to 3 minutes until fluffy. Scrape down the sides of the bowl.",
        "On low speed, add the graham mixture from the blender. After 1 minute, increase the speed to medium-high and mix for another 2 minutes. Scrape down the bowl again. If the mixture is not uniform in color and texture, mix for 1 more minute.",
        "Use immediately, or store in an airtight container in the fridge for up to 1 week."
      ]
    },
    {
      "name": "Milk Soak & Assembly",
      "equipment": [
        ["8 inch cake ring"],
        ["Roll 6 inch wide acetate"],
        ["10 inch cake board"]
      ],
      "ingredients": [["Milk", "110 grams"]],
      "instructions": [
        "Slide the cooled cake out of the pan onto a clean counter, keeping the parchment underneath. Use a cake ring to cut out 2 rounds from the cake for the top layers. The remaining cake will be used for the bottom layer.",
        "Clean the cake ring and place it in the center of the cake board. Line the inside of the ring with a strip of acetate.",
        "Press the cake scraps into the ring to form an even bottom layer.",
        "Brush one-third of the milk (about 35 grams) evenly over the cake layer.",
        "Spread half of the liquid cheesecake evenly over the cake.",
        "Sprinkle one-third of the milk crumbs evenly over the cheesecake, pressing gently to anchor them.",
        "Spread one-third of the graham frosting evenly over the crumbs.",
        "To make layering easier, cut the next layer into two half-circles. Place the half circles on top of the frosting to make a full layer. Repeat the layering process: soak with milk, spread cheesecake, add milk crumbs, then graham frosting.",
        "Place the final cake round on top and brush with milk. Cover with the remaining frosting, spreading evenly. Garnish with the remaining milk crumbs.",
        "Transfer the sheet pan to the freezer and freeze for at least 12 hours to set. The cake will keep in the freezer for up to 2 weeks.",
        "At least 3 hours before serving, remove the cake from the freezer. Slide it out of the ring, peel away the acetate, and transfer to a platter or cake stand. Defrost in the fridge for at least 3 hours. The finished cake can be stored, well wrapped, in the fridge for up to 5 days."
      ]
    }
  ]
}
