{
  "title": "Milk Bar Chocolate Malt Cake",
  "version": "v0.1.0",
  "components": [
    {
      "name": "Assembly",
      "equipment": [
        ["8 inch cake ring"],
        ["Roll 6 inch wide acetate"],
        ["10 inch cake board"]
      ],
      "instructions": [
        "Slide the cooled cake out of the pan onto a clean counter, keeping the parchment underneath. Use a cake ring to cut out 2 rounds from the cake for the top layers. The remaining cake will be used for the bottom layer.",
        "Clean the cake ring and place it in the center of the cake board. Line the inside of the ring with a strip of acetate.",
        "Put the cake scraps together inside the ring and use the back of your hand to tamp the scraps together into a flat even layer.",
        "Dunk a pastry brush in the Ovaltine™ soak and give the layer of cake a good, healthy bath of one-third of the soak.",
        "Use the back of a spoon to spread one-half of the malt fudge sauce in an even layer over the cake.",
        "Sprinkle one-third of the malted milk crumbs and one-half of the charred marshmallows evenly over the malt fudge sauce.",
        "Use the back of a spoon to spread one-third of the malt frosting as evenly as possible over the crumbs and marshmallows.",
        "Set a cake round on top of the frosting, and repeat the process from the first layer.",
        "Nestle the remaining cake round into the frosting. Brush with the soak and cover the top of the cake with the remaining frosting. Garnish the frosting with the remaining malt crumbs.",
        "Wrap the cake tightly in plastic wrap, then freeze for at least 12 hours to set the cake and filling; it will keep frozen for up to two weeks.",
        "At least 3 hours before serving, remove the cake from the freezer. Slide it out of the ring, peel away the acetate, and transfer to a platter or cake stand. Defrost in the fridge for at least 3 hours. The finished cake can be stored, well wrapped, in the fridge for up to 5 days."
      ]
    },
    {
      "name": "Cake",
      "equipment": [],
      "ingredients": [
        ["unsalted butter at room temperature", "230 grams"],
        ["granulated sugar", "450 grams"],
        ["light brown sugar", "120 grams"],
        ["eggs", "6 large"],
        ["buttermilk", "220 grams"],
        ["neutral oil", "210 grams"],
        ["vanilla extract", "10 grams"],
        ["cake flour", "308 grams"],
        ["cocoa powder", "140 grams"],
        ["baking powder", "12 grams"],
        ["kosher salt", "14 grams"]
      ],
      "instructions": [
        "Heat the oven to 350°F.",
        "Combine the butter and sugars in the bowl of a stand mixer fitted with the paddle attachment and cream together on medium-high for 2 to 3 minutes. Scrape down the sides of the bowl, add the eggs, and mix on medium-high for 2 to 3 minutes. Scrape down the sides of the bowl once more.",
        "On low speed, stream in the buttermilk, oil, and vanilla. Increase the mixer speed to medium-high and paddle for 4 to 6 minutes, until the mixture is much lighter in color, twice the size of your original fluffy butter-and-sugar mixture, and completely homogeneous. Don’t rush the process. You’re basically forcing too much liquid into an already fatty mixture that doesn’t want to make room for the liquid. There should be no streaks of fat or liquid. Stop the mixer and scrape down the sides of the bowl.",
        "On low speed, add the cake flour, cocoa powder, baking powder, and salt. Mix for 45 to 60 seconds, just until your batter comes together and any remnants of dry ingredients have been incorporated. Scrape down the sides of the bowl.",
        "Spray a 13 × 18-inch sheet pan with cooking spray and line with parchment. Using a spatula, spread the cake batter in an even layer in the pan. Give the bottom of your cake pan a tap on the countertop to even out the layer.",
        "Bake the cake for 30-35 minutes. The cake will rise and puff, rising to the top of the sheet pan. At 30 minutes, gently poke the edge of the cake with your finger: The cake should bounce back slightly and the center should no longer be jiggly. Leave the cake in the oven for an extra 3 to 5 minutes if it doesn’t pass these tests.",
        "Take the cake out of the oven and cool on a wire rack or, in a pinch, in the fridge or freezer (don’t worry, it’s not cheating). The cooled cake can be stored in the fridge, wrapped in plastic wrap, for up to 5 days."
      ]
    },
    {
      "name": "Malt Crumb",
      "equipment": [],
      "ingredients": [
        ["milk powder", "50 grams"],
        ["all-purpose flour", "94 grams"],
        ["cornstarch", "32 grams"],
        ["Ovaltine™", "40 grams"],
        ["sugar", "40 grams"],
        ["kosher salt", "4 grams"],
        ["unsalted butter melted", "100 grams"],
        ["milk powder", "10 grams"],
        ["Ovaltine™", "30 grams"],
        ["white chocolate - melted", "180 grams"]
      ],
      "instructions": [
        "Heat the oven to 250°F.",
        "Combine the 50 grams milk powder, the flour, cornstarch, 40 grams of Ovaltine™, sugar, and salt in a medium bowl. Toss with your hands to mix. Add the melted butter and toss, using a spatula, until the mixture starts to come together and form small clusters.",
        "Spread the clusters on a parchment lined sheet pan and bake for 20 minutes. The crumbs should be sandy at that point, and your kitchen should smell like buttery heaven. Cool the crumbs completely.",
        "Crumble any milk crumb clusters that are larger than ½ inch in diameter, and put the crumbs in a medium bowl. Combine the 30 grams of Ovaltine™ and milk powder and toss together with crumbs until it is evenly distributed throughout the mixture.",
        "Pour the white chocolate over the crumbs and toss until your clusters are enrobed. Then continue tossing them every 5 minutes until the white chocolate hardens and the clusters are no longer sticky. The crumbs will keep in an airtight container in the fridge or freezer for up to 1 month."
      ]
    },
    {
      "name": "Malt Frosting",
      "equipment": [],
      "ingredients": [
        ["unsalted butter", "696 grams"],
        ["powdered sugar", "996 grams"],
        ["kosher salt", "18 grams"],
        ["cocoa powder", "66 grams"],
        ["Ovaltine™", "66 grams"],
        ["whole milk", "156 grams"]
      ],
      "instructions": [
        "Combine the butter, sugar, salt, and cocoa powder and Ovaltine™ in the bowl of a stand mixer fitted with the paddle attachment and cream together on medium-high for 5 to 7 minutes, until the mixture is smooth and fluffy. Scrape down the sides of the bowl.",
        "With the mixer on its lowest speed, stream in the milk. Crank the mixer up to medium-high and beat for 2 to 3 minutes, until the mixture is silky smooth and a glossy. Scrape down the sides of the bowl. Use the frosting immediately, or store it in an airtight container in the fridge for up to 1 week."
      ]
    },
    {
      "name": "Malt Fudge Sauce",
      "equipment": [],
      "ingredients": [
        ["72% chocolate - chopped", "120 grams"],
        ["Ovaltine™", "160 grams"],
        ["molasses", "10 grams"],
        ["kosher salt", "2 grams"],
        ["glucose", "400 grams"],
        ["granulated sugar", "100 grams"],
        ["heavy cream", "220 grams"]
      ],
      "instructions": [
        "Combine the chocolate, Ovaltine™, and salt in medium bowl.",
        "Combine the glucose, molasses, sugar, and heavy cream in a heavy-bottomed saucepan and stir intermittently while bringing to a boil over high heat. The moment it boils, pour it into the bowl holding the chocolate. Let sit for 1 full minute.",
        "Slowly, slowly begin to whisk the mixture. Then continue, increasingly the vigor of your whisking every 30 seconds, until the mixture is glossy and silky-smooth. This will take 2 to 4 minutes, depending on your speed and strength. You can use this sauce at this point or store it in an airtight container in the fridge for up to 2 weeks; do not freeze."
      ]
    },
    {
      "name": "Marshmallow",
      "equipment": [],
      "ingredients": [["mini marshmallows", "300 grams"]],
      "instructions": [
        "Spread the marshmallows out evenly on an unlined sheet pan and char them to hell and back with a blowtorch. Transfer the pan to the fridge or freezer for 10 minutes to firm up and make them easier to handle. Use immediately or store in an airtight container at room temperature for up to 1 week."
      ]
    },
    {
      "name": "Ovaltine Soak",
      "equipment": [],
      "ingredients": [
        ["whole milk", "110 grams"],
        ["Ovaltine™", "20 grams"]
      ],
      "instructions": [
        "Whisk together milk and Ovaltine™ in a small bowl until the Ovaltine™ is completely dissolved. Use immediately."
      ]
    }
  ]
}
